-- MySQL dump 10.13  Distrib 8.0.20, for Linux (x86_64)
--
-- Host: localhost    Database: employmentActionSystem
-- ------------------------------------------------------
-- Server version	8.0.20

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admins`
--

DROP TABLE IF EXISTS `admins`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admins` (
  `personId` char(11) NOT NULL,
  `nationalId` char(10) NOT NULL,
  `firstName` varchar(50) NOT NULL,
  `lastName` varchar(50) NOT NULL,
  `fatherName` varchar(50) NOT NULL,
  `jobTitle` char(4) NOT NULL DEFAULT 'مدیر',
  `birth` date NOT NULL,
  `gender` varchar(6) NOT NULL,
  `married` varchar(5) NOT NULL DEFAULT 'مجرد',
  `numberOfChildren` int NOT NULL DEFAULT '0',
  `registrationDate` date NOT NULL,
  `education` varchar(20) NOT NULL,
  `city` int NOT NULL,
  `password` varchar(100) NOT NULL,
  `courseHours` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`personId`),
  KEY `city` (`city`),
  CONSTRAINT `admins_ibfk_1` FOREIGN KEY (`city`) REFERENCES `cities` (`cityId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admins`
--

LOCK TABLES `admins` WRITE;
/*!40000 ALTER TABLE `admins` DISABLE KEYS */;
/*!40000 ALTER TABLE `admins` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cities`
--

DROP TABLE IF EXISTS `cities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cities` (
  `cityId` int NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `weatherDegree` int NOT NULL DEFAULT '0',
  `notDevelopedregionConstant` int NOT NULL DEFAULT '0',
  `inProvince` int NOT NULL,
  PRIMARY KEY (`cityId`),
  KEY `inProvince` (`inProvince`),
  CONSTRAINT `cities_ibfk_1` FOREIGN KEY (`inProvince`) REFERENCES `provinces` (`provinceId`)
) ENGINE=InnoDB AUTO_INCREMENT=615 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cities`
--

LOCK TABLES `cities` WRITE;
/*!40000 ALTER TABLE `cities` DISABLE KEYS */;
INSERT INTO `cities` VALUES (6,'شهر سرعین',0,0,3),(7,'شهر اردبیل',0,0,3),(8,'شهر مشگین شهر',0,0,3),(9,'شهر خلخال',0,0,3),(10,'شهر گرمی',0,0,3),(11,'شهر عنبران',0,0,3),(12,'شهر رضی',0,0,3),(13,'شهر نیر',0,0,3),(14,'شهر نمین',0,0,3),(15,'شهر بیله‌سوار',0,0,3),(16,'شهر پارس آباد',0,0,3),(22,'شهر اصفهان',0,0,4),(23,'شهر کاشان',0,0,4),(24,'شهر خوانسار',0,0,4),(25,'شهر گلپایگان',0,0,4),(26,'شهر خور و بیابانک',0,0,4),(27,'شهر نائین',0,0,4),(28,'شهر ابیانه',0,0,4),(29,'شهر شاهین شهر',0,0,4),(30,'شهر نطنز',0,0,4),(31,'شهر مبارکه',0,0,4),(32,'شهر زواره',0,0,4),(33,'شهر سمیرم',0,0,4),(34,'شهر شهرضا',0,0,4),(35,'شهر فریدون شهر',0,0,4),(36,'شهر بیاضه',0,0,4),(37,'شهر میمه',0,0,4),(38,'شهر ورزنه',0,0,4),(39,'شهر زرین شهر',0,0,4),(40,'شهر نجف آباد',0,0,4),(41,'شهر اردستان',0,0,4),(42,'شهر آران و بیدگل',0,0,4),(43,'شهر خور',0,0,4),(44,'شهر خمینی شهر',0,0,4),(52,'شهر کرج',0,0,5),(53,'شهر طالقان',0,0,5),(54,'شهر کردان',0,0,5),(55,'شهر شهرستانک',0,0,5),(56,'شهر نظرآباد',0,0,5),(57,'شهر هشتگرد',0,0,5),(59,'شهر ایلام',0,0,6),(60,'شهر دهلران',0,0,6),(61,'شهر سیروان',0,0,6),(62,'شهر مهران',0,0,6),(63,'شهر ایوان',0,0,6),(64,'شهر آبدانان',0,0,6),(65,'شهر دره شهر',0,0,6),(66,'شهر سراب کلان',0,0,6),(67,'شهر چرداول',0,0,6),(74,'شهر بوشهر',0,0,7),(75,'شهر عسلویه',0,0,7),(76,'شهر برازجان',0,0,7),(77,'شهر سعدآباد',0,0,7),(78,'شهر گناوه',0,0,7),(79,'شهر جزیره عباسک',0,0,7),(80,'شهر جزیره چراغی',0,0,7),(81,'شهر جزیره تهمادو (جبرین)',0,0,7),(82,'شهر اَهرَم',0,0,7),(83,'شهر دلوار',0,0,7),(84,'شهر خورموج',0,0,7),(85,'شهر سجادیه (احشام کهنه)',0,0,7),(86,'شهر بندر سیراف',0,0,7),(87,'شهر خارک',0,0,7),(89,'شهر تهران',0,0,8),(90,'شهر دماوند',0,0,8),(91,'شهر ورامین',0,0,8),(92,'شهر فیروزکوه',0,0,8),(93,'شهر سولقان',0,0,8),(94,'شهر اسلامشهر',0,0,8),(95,'شهر لواسان',0,0,8),(96,'شهر دربندسر',0,0,8),(97,'شهر رباط کریم',0,0,8),(98,'شهر رودبار قصران',0,0,8),(104,'شهر شهرکرد',0,0,9),(105,'شهر بروجن',0,0,9),(106,'شهر کوهرنگ',0,0,9),(107,'شهر فارسان',0,0,9),(108,'شهر لردگان',0,0,9),(109,'شهر اردل',0,0,9),(110,'شهر هفشجان',0,0,9),(111,'شهر سامان',0,0,9),(112,'شهر بن',0,0,9),(119,'شهر تبریز',0,0,1),(120,'شهر جلفا',0,0,1),(121,'شهر کلیبر',0,0,1),(122,'شهر مراغه',0,0,1),(123,'شهر سراب',0,0,1),(124,'شهر مرند',0,0,1),(125,'شهر بناب',0,0,1),(126,'شهر اسکو',0,0,1),(127,'شهر کندوان',0,0,1),(128,'شهر شبستر',0,0,1),(129,'شهر سردرود',0,0,1),(130,'شهر عجب شیر',0,0,1),(131,'شهر میانه',0,0,1),(132,'شهر لیلان',0,0,1),(133,'شهر لیقوان',0,0,1),(134,'شهر ورزقان',0,0,1),(135,'شهر هشترود',0,0,1),(136,'شهر نقده',0,0,1),(137,'شهر بستان آباد',0,0,1),(138,'شهر اهر',0,0,1),(150,'شهر ارومیه',0,0,2),(151,'شهر پیرانشهر',0,0,2),(152,'شهر خوی',0,0,2),(153,'شهر مهاباد',0,0,2),(154,'شهر ماکو',0,0,2),(155,'شهر میاندوآب',0,0,2),(156,'شهر سلماس',0,0,2),(157,'شهر سیه چشمه',0,0,2),(158,'شهر سردشت',0,0,2),(159,'شهر بوکان',0,0,2),(160,'شهر تکاب',0,0,2),(165,'شهر بیرجند',0,0,10),(166,'شهر طبس',0,0,10),(167,'شهر فردوس',0,0,10),(168,'شهر نهبندان',0,0,10),(169,'شهر درمیان',0,0,10),(170,'شهر سربیشه',0,0,10),(171,'شهر اسدیه',0,0,10),(172,'شهر بشرویه',0,0,10),(173,'شهر خوسف',0,0,10),(174,'شهر سرایان',0,0,10),(175,'شهر خضری دشت بیاض',0,0,10),(176,'شهر چنشت',0,0,10),(180,'شهر مشهد',0,0,11),(181,'شهر نیشابور',0,0,11),(182,'شهر سبزوار',0,0,11),(183,'شهر شیروان',0,0,11),(184,'شهر قوچان',0,0,11),(185,'شهر چناران',0,0,11),(186,'شهر تربت جام',0,0,11),(187,'شهر سرخس',0,0,11),(188,'شهر قاین',0,0,11),(189,'شهر قدمگاه',0,0,11),(190,'شهر کاشمر',0,0,11),(191,'شهر کلات نادری',0,0,11),(192,'شهر کنگ',0,0,11),(193,'شهر شاندیز',0,0,11),(195,'شهر طرقبه',0,0,11),(196,'شهر گناباد',0,0,11),(197,'شهر مشهد ریزه',0,0,11),(198,'شهر نشتیفان',0,0,11),(199,'شهر اسفدن',0,0,11),(200,'شهر بردستان',0,0,11),(201,'شهر بجستان',0,0,11),(202,'شهر باخرز',0,0,11),(203,'شهر اخلمد',0,0,11),(204,'شهر بردسکن',0,0,11),(205,'شهر خواف',0,0,11),(206,'شهر درگز',0,0,11),(207,'شهر رشتخوار',0,0,11),(208,'شهر خرگرد',0,0,11),(209,'شهر تربت حیدریه',0,0,11),(210,'شهر تایباد',0,0,11),(211,'شهر توس',0,0,11),(243,'شهر بجنورد',0,0,12),(244,'شهر گرمه',0,0,12),(245,'شهر فاروج',0,0,12),(246,'شهر صفی اباد',0,0,12),(247,'شهر شوقان',0,0,12),(248,'شهر آشخانه',0,0,12),(249,'شهر اسپاخو',0,0,12),(250,'شهر اسفراین',0,0,12),(251,'شهر جاجرم',0,0,12),(258,'شهر اهواز',0,0,13),(259,'شهر آبادان',0,0,13),(260,'شهر شوشتر',0,0,13),(261,'شهر بندرماهشهر',0,0,13),(262,'شهر دزفول',0,0,13),(263,'شهر بهبهان',0,0,13),(264,'شهر خرمشهر',0,0,13),(265,'شهر ایذه',0,0,13),(266,'شهر اندیمشک',0,0,13),(267,'شهر بندر امام خمینی',0,0,13),(268,'شهر قیدار',0,0,13),(269,'شهر قلعه تل',0,0,13),(270,'شهر کوشک',0,0,13),(271,'شهر شادگان',0,0,13),(272,'شهر شوش',0,0,13),(273,'شهر جزیره دارا',0,0,13),(274,'شهر جزیره بونه',0,0,13),(275,'شهر مسجد سلیمان',0,0,13),(276,'شهر لالی',0,0,13),(277,'شهر هویزه',0,0,13),(278,'شهر هندیجان',0,0,13),(279,'شهر امیدیه',0,0,13),(280,'شهر بیشه‌بزان',0,0,13),(281,'شهر دهدز',0,0,13),(282,'شهر رامهرمز',0,0,13),(283,'شهر پادگان دوکوهه',0,0,13),(284,'شهر بندر اروندکنار',0,0,13),(289,'شهر زنجان',0,0,14),(290,'شهر سلطانیه',0,0,14),(291,'شهر طارم',0,0,14),(292,'شهر خدابنده (قیدار)',0,0,14),(293,'شهر زرین رود',0,0,14),(294,'شهر زرین‌آباد',0,0,14),(295,'شهر ماهنشان',0,0,14),(296,'شهر اب بر',0,0,14),(297,'شهر خرم دره',0,0,14),(304,'شهر سمنان',0,0,15),(305,'شهر شاهرود',0,0,15),(306,'شهر مهدی شهر',0,0,15),(307,'شهر دامغان',0,0,15),(308,'شهر بسطام',0,0,15),(309,'شهر گرمسار',0,0,15),(310,'شهر قلعه نوخرقان',0,0,15),(311,'شهر شهمیرزاد',0,0,15),(312,'شهر سرخه',0,0,15),(313,'شهر میامی',0,0,15),(319,'شهر چابهار',0,0,16),(320,'شهر زاهدان',0,0,16),(321,'شهر ایرانشهر',0,0,16),(322,'شهر کنارک',0,0,16),(323,'شهر میرجاوه',0,0,16),(324,'شهر نیک شهر',0,0,16),(325,'شهر سرباز',0,0,16),(326,'شهر بزمان',0,0,16),(327,'شهر بمپور',0,0,16),(328,'شهر سراوان',0,0,16),(329,'شهر زهک',0,0,16),(330,'شهر زابل',0,0,16),(331,'شهر خاش',0,0,16),(334,'شهر شیراز',0,0,17),(335,'شهر مرودشت',0,0,17),(336,'شهر جهرم',0,0,17),(337,'شهر اقلید',0,0,17),(338,'شهر داراب',0,0,17),(339,'شهر سپیدان',0,0,17),(340,'شهر کازرون',0,0,17),(341,'شهر لار',0,0,17),(342,'شهر استهبان',0,0,17),(343,'شهر فیروزآباد',0,0,17),(344,'شهر آباده',0,0,17),(345,'شهر فسا',0,0,17),(346,'شهر قیر',0,0,17),(347,'شهر کوار',0,0,17),(348,'شهر گراش',0,0,17),(349,'شهر سوریان',0,0,17),(350,'شهر لامرد',0,0,17),(351,'شهر مهر',0,0,17),(352,'شهر نی‌ریز',0,0,17),(353,'شهر ارسنجان',0,0,17),(354,'شهر اوز',0,0,17),(355,'شهر سروستان',0,0,17),(356,'شهر خنج',0,0,17),(357,'شهر جویم',0,0,17),(365,'شهر قزوین',0,0,18),(366,'شهر ابهر',0,0,18),(367,'شهر تاکستان',0,0,18),(368,'شهر ابگرم قزوین',0,0,18),(369,'شهر بوئین زهرا',0,0,18),(372,'شهر قم',0,0,19),(373,'شهر کهک',0,0,19),(374,'شهر سلفچگان',0,0,19),(375,'شهر بانه',0,0,20),(376,'شهر مریوان',0,0,20),(377,'شهر سقز',0,0,20),(378,'شهر سنندج',0,0,20),(379,'شهر قروه',0,0,20),(380,'شهر بیجار',0,0,20),(381,'شهر اورامان',0,0,20),(382,'شهر کامیاران',0,0,20),(383,'شهر دیواندره',0,0,20),(390,'شهر کرمان',0,0,21),(391,'شهر سیرجان',0,0,21),(392,'شهر بم',0,0,21),(393,'شهر رفسنجان',0,0,21),(394,'شهر ماهان',0,0,21),(395,'شهر کهنوج',0,0,21),(396,'شهر فهرج',0,0,21),(397,'شهر جوپار',0,0,21),(398,'شهر راور',0,0,21),(399,'شهر منوجان',0,0,21),(400,'شهر کوهبنان',0,0,21),(401,'شهر میمند',0,0,21),(402,'شهر بردسیر',0,0,21),(403,'شهر انار',0,0,21),(404,'شهر بافت',0,0,21),(405,'شهر جیرفت',0,0,21),(406,'شهر شهر بابک',0,0,21),(407,'شهر راین',0,0,21),(421,'شهر کرمانشاه',0,0,22),(422,'شهر بیستون',0,0,22),(423,'شهر پاوه',0,0,22),(424,'شهر قصر شیرین',0,0,22),(425,'شهر کنگاور',0,0,22),(426,'شهر کرند غرب',0,0,22),(427,'شهر گیلانغرب',0,0,22),(428,'شهر کوزران',0,0,22),(429,'شهر کل کل',0,0,22),(430,'شهر سنقر',0,0,22),(431,'شهر صحنه',0,0,22),(432,'شهر دالاهو',0,0,22),(433,'شهر هرسین',0,0,22),(434,'شهر سرپل ذهاب',0,0,22),(435,'شهر اسلام اباد غرب',0,0,22),(436,'شهر روانسر',0,0,22),(437,'شهر جوانرود',0,0,22),(452,'شهر یاسوج',0,0,23),(453,'شهر سی سخت',0,0,23),(454,'شهر گچساران',0,0,23),(455,'شهر دیشموک',0,0,23),(456,'شهر پاتاوه',0,0,23),(457,'شهر دهدشت',0,0,23),(458,'شهر لیکک',0,0,23),(459,'شهر باشت',0,0,23),(460,'شهر چرام',0,0,23),(467,'شهر گرگان',0,0,24),(468,'شهر علی آبادکتول',0,0,24),(469,'شهر مینودشت',0,0,24),(470,'شهر آزادشهر',0,0,24),(471,'شهر کردکوی',0,0,24),(472,'شهر کلاله',0,0,24),(473,'شهر گنبد کاووس',0,0,24),(474,'شهر مرواه‌تپه',0,0,24),(475,'شهر گالیکش',0,0,24),(476,'شهر رامیان',0,0,24),(477,'شهر بندرترکمن',0,0,24),(482,'شهر بندر انزلی',0,0,25),(483,'شهر آستارا',0,0,25),(484,'شهر رشت',0,0,25),(485,'شهر لاهیجان',0,0,25),(486,'شهر لنگرود',0,0,25),(487,'شهر رودسر',0,0,25),(488,'شهر چابکسر',0,0,25),(489,'شهر فومن',0,0,25),(490,'شهر تالش',0,0,25),(491,'شهر ماسال',0,0,25),(492,'شهر اسالم',0,0,25),(493,'شهر ماسوله',0,0,25),(494,'شهر کیاشهر',0,0,25),(495,'شهر صومعه سرا',0,0,25),(496,'شهر رودبار',0,0,25),(497,'شهر شفت',0,0,25),(498,'شهر منجیل',0,0,25),(499,'شهر لوشان',0,0,25),(500,'شهر لوندویل',0,0,25),(501,'شهر بره سر',0,0,25),(502,'شهر آستانه اشرفیه',0,0,25),(503,'شهر املش',0,0,25),(504,'شهر سیاهکل',0,0,25),(505,'شهر دیلمان',0,0,25),(506,'شهر داماش',0,0,25),(507,'شهر پره‌سر',0,0,25),(513,'شهر خرم آباد',0,0,26),(514,'شهر الیگودرز',0,0,26),(515,'شهر بروجرد',0,0,26),(516,'شهر دورود',0,0,26),(517,'شهر کوهدشت',0,0,26),(518,'شهر ازنا',0,0,26),(519,'شهر درود',0,0,26),(520,'شهر پل دختر',0,0,26),(528,'شهر رامسر',0,0,27),(529,'شهر نوشهر',0,0,27),(530,'شهر محمودآباد',0,0,27),(531,'شهر بابلسر',0,0,27),(532,'شهر چالوس',0,0,27),(533,'شهر تنکابن',0,0,27),(534,'شهر ساری',0,0,27),(535,'شهر کلاردشت',0,0,27),(536,'شهر نور',0,0,27),(537,'شهر بابل',0,0,27),(538,'شهر آمل',0,0,27),(539,'شهر عباس آباد',0,0,27),(540,'شهر لاریجان',0,0,27),(541,'شهر بهشهر',0,0,27),(542,'شهر سلمان شهر',0,0,27),(543,'شهر قائمشهر',0,0,27),(544,'شهر مرزن آباد',0,0,27),(545,'شهر کتالم',0,0,27),(546,'شهر گلوگاه',0,0,27),(547,'شهر فریدونکنار',0,0,27),(548,'شهر الاشت',0,0,27),(549,'شهر نمک آبرود',0,0,27),(550,'شهر سوادکوه',0,0,27),(551,'شهر شیرگاه',0,0,27),(552,'شهر ایزدشهر',0,0,27),(553,'شهر بلده',0,0,27),(554,'شهر سیاه بیشه',0,0,27),(555,'شهر رستمکلا',0,0,27),(556,'شهر پل سفید',0,0,27),(557,'شهر جنت رودبار',0,0,27),(559,'شهر اراک',0,0,28),(560,'شهر محلات',0,0,28),(561,'شهر تفرش',0,0,28),(562,'شهر دلیجان',0,0,28),(563,'شهر ساوه',0,0,28),(564,'شهر خمین',0,0,28),(565,'شهر شازند',0,0,28),(566,'شهر نراق',0,0,28),(567,'شهر گورچان',0,0,28),(574,'شهر قشم',0,0,29),(575,'شهر کیش',0,0,29),(576,'شهر بندر عباس',0,0,29),(577,'شهر میناب',0,0,29),(578,'شهر بندر لنگه',0,0,29),(579,'شهر جزیره شیدور',0,0,29),(580,'شهر جزیره ابوموسی',0,0,29),(581,'شهر بستک',0,0,29),(582,'شهر جزیره هرمز',0,0,29),(583,'شهر جزیره هنگام',0,0,29),(584,'شهر بندر کنگ',0,0,29),(585,'شهر بندر دیلم',0,0,29),(586,'شهر حاجی اباد',0,0,29),(589,'شهر همدان',0,0,30),(590,'شهر تویسرکان',0,0,30),(591,'شهر لالجین',0,0,30),(592,'شهر ملایر',0,0,30),(593,'شهر سرکان',0,0,30),(594,'شهر فرسفج',0,0,30),(595,'شهر نهاوند',0,0,30),(596,'شهر اسد آباد',0,0,30),(597,'شهر کبودرآهنگ',0,0,30),(598,'شهر سامن',0,0,30),(604,'شهر یزد',0,0,31),(605,'شهر مهریز',0,0,31),(606,'شهر اردکان',0,0,31),(607,'شهر بافق',0,0,31),(608,'شهر ابرکوه',0,0,31),(609,'شهر میبد',0,0,31),(610,'شهر رضوانشهر',0,0,31),(611,'شهر تفت',0,0,31),(612,'شهر ندوشن',0,0,31),(613,'شهر اشکذر',0,0,31),(614,'شهر خرانق',0,0,31);
/*!40000 ALTER TABLE `cities` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `employmentAction`
--

DROP TABLE IF EXISTS `employmentAction`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `employmentAction` (
  `owner` char(11) NOT NULL,
  `actionId` int NOT NULL AUTO_INCREMENT,
  `jobAllowance` float NOT NULL DEFAULT '0',
  `employeeAllowance` float NOT NULL DEFAULT '0',
  `notDevelopedRegionAllowance` float NOT NULL DEFAULT '0',
  `badWeatherRegionAllowance` float NOT NULL DEFAULT '0',
  `familyHelp` float NOT NULL DEFAULT '0',
  `childrenHelp` float NOT NULL DEFAULT '0',
  `jobDifficultnessAllowance` float NOT NULL DEFAULT '0',
  `jobSpecial` float NOT NULL DEFAULT '0',
  `salary` float NOT NULL DEFAULT '0',
  `issueDate` date NOT NULL,
  `jobClass` int NOT NULL DEFAULT '12',
  `jobrank` varchar(20) NOT NULL,
  PRIMARY KEY (`actionId`),
  KEY `owner` (`owner`),
  CONSTRAINT `employmentAction_ibfk_1` FOREIGN KEY (`owner`) REFERENCES `teachers` (`personId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `employmentAction`
--

LOCK TABLES `employmentAction` WRITE;
/*!40000 ALTER TABLE `employmentAction` DISABLE KEYS */;
/*!40000 ALTER TABLE `employmentAction` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `provinces`
--

DROP TABLE IF EXISTS `provinces`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `provinces` (
  `name` varchar(35) NOT NULL,
  `provinceId` int NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`provinceId`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `provinces`
--

LOCK TABLES `provinces` WRITE;
/*!40000 ALTER TABLE `provinces` DISABLE KEYS */;
INSERT INTO `provinces` VALUES ('آذربایجان شرقی',1),('آذربایجان غربی',2),('اردبیل',3),('اصفهان',4),('البرز',5),('ایلام',6),('بوشهر',7),('تهران',8),('چهارمحال و بختیاری',9),('خراسان جنوبی',10),('خراسان رضوی',11),('خراسان شمالی',12),('خوزستان',13),('زنجان',14),('سمنان',15),('سیستان و بلوچستان',16),('فارس',17),('قزوین',18),('قم',19),('کردستان',20),('کرمان',21),('کرمانشاه',22),('کهگیلویه و بویراحمد',23),('گلستان',24),('گیلان',25),('لرستان',26),('مازندران',27),('مرکزی',28),('هرمزگان',29),('همدان',30),('یزد',31);
/*!40000 ALTER TABLE `provinces` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `systemConstants`
--

DROP TABLE IF EXISTS `systemConstants`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `systemConstants` (
  `yearConstant` float NOT NULL DEFAULT '0',
  `familyConstantAllowance` float NOT NULL DEFAULT '0',
  `childrenConstantMoney` float NOT NULL DEFAULT '0',
  `jobDifficultnessScore` float NOT NULL DEFAULT '0',
  `jobAllowanceScore` float NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `systemConstants`
--

LOCK TABLES `systemConstants` WRITE;
/*!40000 ALTER TABLE `systemConstants` DISABLE KEYS */;
/*!40000 ALTER TABLE `systemConstants` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `teachers`
--

DROP TABLE IF EXISTS `teachers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `teachers` (
  `personId` char(11) NOT NULL,
  `nationalId` char(10) NOT NULL,
  `firstName` varchar(50) NOT NULL,
  `lastName` varchar(50) NOT NULL,
  `fatherName` varchar(50) NOT NULL,
  `jobTitle` char(4) NOT NULL DEFAULT 'دبیر',
  `birth` date NOT NULL,
  `gender` varchar(6) NOT NULL,
  `married` varchar(5) NOT NULL DEFAULT 'مجرد',
  `numberOfChildren` int NOT NULL DEFAULT '0',
  `registrationDate` date NOT NULL,
  `education` varchar(20) NOT NULL,
  `city` int NOT NULL,
  `password` varchar(100) NOT NULL,
  `courseHours` int NOT NULL DEFAULT '0',
  PRIMARY KEY (`personId`),
  KEY `city` (`city`),
  CONSTRAINT `teachers_ibfk_1` FOREIGN KEY (`city`) REFERENCES `cities` (`cityId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teachers`
--

LOCK TABLES `teachers` WRITE;
/*!40000 ALTER TABLE `teachers` DISABLE KEYS */;
/*!40000 ALTER TABLE `teachers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `time`
--

DROP TABLE IF EXISTS `time`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `time` (
  `currentTime` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `time`
--

LOCK TABLES `time` WRITE;
/*!40000 ALTER TABLE `time` DISABLE KEYS */;
/*!40000 ALTER TABLE `time` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-23 11:25:07
